/**
 * @author Rex Joush
 * @time 2021.10.28
 */

/*
    超过经理收入的员工
    https://leetcode-cn.com/problems/employees-earning-more-than-their-managers/

    Employee 表包含所有员工，他们的经理也属于员工。
    每个员工都有一个 Id，此外还有一列对应员工的经理的 Id。
    +----+-------+--------+-----------+
    | Id | Name  | Salary | ManagerId |
    +----+-------+--------+-----------+
    | 1  | Joe   | 70000  | 3         |
    | 2  | Henry | 80000  | 4         |
    | 3  | Sam   | 60000  | NULL      |
    | 4  | Max   | 90000  | NULL      |
    +----+-------+--------+-----------+

    给定 Employee 表，编写一个 SQL 查询，该查询可以获取收入超过他们经理的员工的姓名。
    在上面的表格中，Joe 是唯一一个收入超过他的经理的员工。
    +----------+
    | Employee |
    +----------+
    | Joe      |
    +----------+
 */

/*
    1.自己和自己笛卡尔积获得结果
    +----+-------+--------+-----------+----+-------+--------+-----------+
    | Id | Name  | Salary | ManagerId | Id | Name  | Salary | ManagerId |
    +----+-------+--------+-----------+----+-------+--------+-----------+
    | 1  | Joe   | 70000  | 3         | 1  | Joe   | 70000  | 3         |
    | 2  | Henry | 80000  | 4         | 1  | Joe   | 70000  | 3         |
    | 3  | Sam   | 60000  | NULL      | 1  | Joe   | 70000  | 3         |
    | 4  | Max   | 90000  | NULL      | 1  | Joe   | 70000  | 3         |
    | .  |  .    |    .   |     .     | .  |   .   |   .    |     .     |
    | .  |  .    |    .   |     .     | .  |   .   |   .    |     .     |
    | .  |  .    |    .   |     .     | .  |   .   |   .    |     .     |
    +----+-------+--------+-----------+----+-------+--------+-----------+
    笛卡尔积完毕后，只需筛选自己比领导高的，且自己与领导 id 对应的结果即可
    结果：
        430 ms, 26.00%
        0 MB, 100.00%
 */
select a.Name as Employee
from Employee a,
     Employee b
where a.salary > b.salary && a.ManagerId = b.Id;